### START

### PANDAS PYTHON LIBRARY
- This practice set contains 40 tasks each task is refered as T

### ðŸŸ¦ SECTION 1 â€” DATA LOADING & DATAFRAME BASICS (8 Practical Tasks)

### IMPORTING PANDAS LIBRARY

In [193]:
import pandas as pd
import numpy as np

T1. Load a CSV file named employees.csv into a DataFrame and display the top 12 rows.

In [24]:
df1=pd.read_csv(r"D:\data-analytics-porfolio\data-analytics-portfolio\datasets_for_analysis\employees_dataset\employees.csv")
df1.head(12)

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
0,198,Donald,OConnell,DOCONNEL,650.507.9833,21-Jun-07,SH_CLERK,2600,-,124,50
1,199,Douglas,Grant,DGRANT,650.507.9844,13-Jan-08,SH_CLERK,2600,-,124,50
2,200,Jennifer,Whalen,JWHALEN,515.123.4444,17-Sep-03,AD_ASST,4400,-,101,10
3,201,Michael,Hartstein,MHARTSTE,515.123.5555,17-Feb-04,MK_MAN,13000,-,100,20
4,202,Pat,Fay,PFAY,603.123.6666,17-Aug-05,MK_REP,6000,-,201,20
5,203,Susan,Mavris,SMAVRIS,515.123.7777,07-Jun-02,HR_REP,6500,-,101,40
6,204,Hermann,Baer,HBAER,515.123.8888,07-Jun-02,PR_REP,10000,-,101,70
7,205,Shelley,Higgins,SHIGGINS,515.123.8080,07-Jun-02,AC_MGR,12008,-,101,110
8,206,William,Gietz,WGIETZ,515.123.8181,07-Jun-02,AC_ACCOUNT,8300,-,205,110
9,100,Steven,King,SKING,515.123.4567,17-Jun-03,AD_PRES,24000,-,-,90
10,101,Neena,Kochhar,NKOCHHAR,515.123.4568,21-Sep-05,AD_VP,17000,-,100,90
11,102,Lex,De Haan,LDEHAAN,515.123.4569,13-Jan-01,AD_VP,17000,-,100,90

T2. Display:
- ï‚· row count
- ï‚· column count
- ï‚· data types
- ï‚· missing value count per column

In [25]:
df1.shape

(50, 11)

In [26]:
df1.dtypes

EMPLOYEE_ID        int64
FIRST_NAME        object
LAST_NAME         object
EMAIL             object
PHONE_NUMBER      object
HIRE_DATE         object
JOB_ID            object
SALARY             int64
COMMISSION_PCT    object
MANAGER_ID        object
DEPARTMENT_ID      int64
dtype: object

In [27]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   EMPLOYEE_ID     50 non-null     int64
 1   FIRST_NAME      50 non-null     object
 2   LAST_NAME       50 non-null     object
 3   EMAIL           50 non-null     object
 4   PHONE_NUMBER    50 non-null     object
 5   HIRE_DATE       50 non-null     object
 6   JOB_ID          50 non-null     object
 7   SALARY          50 non-null     int64
 8   COMMISSION_PCT  50 non-null     object
 9   MANAGER_ID      50 non-null     object
 10  DEPARTMENT_ID   50 non-null     int64
dtypes: int64(3), object(8)
memory usage: 4.4+ KB

T3. Convert column JoinDate to datetime format.

In [ ]:
df1["HIRE_DATE"]=pd.to_datetime(df1["HIRE_DATE"])
df1.head()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
0,198,Donald,OConnell,DOCONNEL,650.507.9833,2007-06-21,SH_CLERK,2600,-,124,50
1,199,Douglas,Grant,DGRANT,650.507.9844,2008-01-13,SH_CLERK,2600,-,124,50
2,200,Jennifer,Whalen,JWHALEN,515.123.4444,2003-09-17,AD_ASST,4400,-,101,10
3,201,Michael,Hartstein,MHARTSTE,515.123.5555,2004-02-17,MK_MAN,13000,-,100,20
4,202,Pat,Fay,PFAY,603.123.6666,2005-08-17,MK_REP,6000,-,201,20

T4. Convert column Department to category dtype.

In [30]:
df2=pd.read_csv(r"D:\data-analytics-porfolio\data-analytics-portfolio\datasets_for_analysis\employees_dataset\empdata.csv")

In [31]:
df2.head()

,EmployeeID,FirstName,LastName,Department,Position,Salary,JoiningDate,Email
0,10100%,John,Doe,Engineering,Software Engineer,7500000%,4353900%,john.doe@example.com
1,10200%,Jane,Smith,Marketing,Marketing Manager,6800000%,4401300%,jane.smith@example.com
2,10300%,Michael,Brown,Engineering,Senior Developer,8800000%,4342400%,michael.brown@example.com
3,10400%,Linda,Johnson,HR,HR Executive,5500000%,4420600%,linda.johnson@example.com
4,10500%,Robert,Williams,Finance,Accountant,6200000%,4371300%,robert.williams@example.com

In [44]:
df2["Department"]=df2["Department"].astype("category")

In [67]:
df2.head()

,EmployeeID,FirstName,LastName,Department,Position,Salary,JoiningDate,Email
0,10100,John,Doe,Engineering,Software Engineer,7500000,1970-02-20 09:25:00,john.doe@example.com
1,10200,Jane,Smith,Marketing,Marketing Manager,6800000,1970-02-20 22:35:00,jane.smith@example.com
2,10300,Michael,Brown,Engineering,Senior Developer,8800000,1970-02-20 06:13:20,michael.brown@example.com
3,10400,Linda,Johnson,HR,HR Executive,5500000,1970-02-21 03:56:40,linda.johnson@example.com
4,10500,Robert,Williams,Finance,Accountant,6200000,1970-02-20 14:15:00,robert.williams@example.com

In [61]:
df2["JoiningDate"]=pd.to_datetime(df2["JoiningDate"].astype("float"),unit="s")

In [66]:
df2.head()

,EmployeeID,FirstName,LastName,Department,Position,Salary,JoiningDate,Email
0,10100,John,Doe,Engineering,Software Engineer,7500000,1970-02-20 09:25:00,john.doe@example.com
1,10200,Jane,Smith,Marketing,Marketing Manager,6800000,1970-02-20 22:35:00,jane.smith@example.com
2,10300,Michael,Brown,Engineering,Senior Developer,8800000,1970-02-20 06:13:20,michael.brown@example.com
3,10400,Linda,Johnson,HR,HR Executive,5500000,1970-02-21 03:56:40,linda.johnson@example.com
4,10500,Robert,Williams,Finance,Accountant,6200000,1970-02-20 14:15:00,robert.williams@example.com

In [64]:
df2["Salary"]=df2["Salary"].str.replace("%","",regex=False).astype("int64")

T5. Keep only columns: Name, Age, Department, Salary.

In [68]:
df2.head()

,EmployeeID,FirstName,LastName,Department,Position,Salary,JoiningDate,Email
0,10100,John,Doe,Engineering,Software Engineer,7500000,1970-02-20 09:25:00,john.doe@example.com
1,10200,Jane,Smith,Marketing,Marketing Manager,6800000,1970-02-20 22:35:00,jane.smith@example.com
2,10300,Michael,Brown,Engineering,Senior Developer,8800000,1970-02-20 06:13:20,michael.brown@example.com
3,10400,Linda,Johnson,HR,HR Executive,5500000,1970-02-21 03:56:40,linda.johnson@example.com
4,10500,Robert,Williams,Finance,Accountant,6200000,1970-02-20 14:15:00,robert.williams@example.com

In [ ]:
df2.drop(columns=["EmployeeID"],inplace=True)
df2.drop(columns=["Email"],inplace=True)

,FirstName,LastName,Department,Position,Salary,JoiningDate
0,John,Doe,Engineering,Software Engineer,7500000,1970-02-20 09:25:00
1,Jane,Smith,Marketing,Marketing Manager,6800000,1970-02-20 22:35:00
2,Michael,Brown,Engineering,Senior Developer,8800000,1970-02-20 06:13:20
3,Linda,Johnson,HR,HR Executive,5500000,1970-02-21 03:56:40
4,Robert,Williams,Finance,Accountant,6200000,1970-02-20 14:15:00

In [86]:
df2.drop(columns=["Position"],inplace=True)

In [87]:
df2.drop(columns=["JoiningDate"],inplace=True)

In [88]:
df2.head()

  FirstName  LastName   Department   Salary
0      John       Doe  Engineering  7500000
1      Jane     Smith    Marketing  6800000
2   Michael     Brown  Engineering  8800000
3     Linda   Johnson           HR  5500000
4    Robert  Williams      Finance  6200000

T6. Remove duplicate rows based on FirstName.

In [107]:
df2[df2.duplicated()]

Empty DataFrame
Columns: [FirstName, LastName, Department, Salary]
Index: []

In [106]:
df2.duplicated(subset=['FirstName', 'LastName'])

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
dtype: bool

In [111]:
df2.drop_duplicates(subset=["FirstName"],inplace=True)
df2.head()

  FirstName  LastName   Department   Salary
0      John       Doe  Engineering  7500000
1      Jane     Smith    Marketing  6800000
2   Michael     Brown  Engineering  8800000
3     Linda   Johnson           HR  5500000
4    Robert  Williams      Finance  6200000

In [112]:
df3=pd.read_csv(r"D:\data-analytics-porfolio\data-analytics-portfolio\datasets_for_analysis\employees_dataset\empdata.csv")

In [113]:
df1.head()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
0,198,Donald,OConnell,DOCONNEL,650.507.9833,2007-06-21,SH_CLERK,2600,-,124,50
1,199,Douglas,Grant,DGRANT,650.507.9844,2008-01-13,SH_CLERK,2600,-,124,50
2,200,Jennifer,Whalen,JWHALEN,515.123.4444,2003-09-17,AD_ASST,4400,-,101,10
3,201,Michael,Hartstein,MHARTSTE,515.123.5555,2004-02-17,MK_MAN,13000,-,100,20
4,202,Pat,Fay,PFAY,603.123.6666,2005-08-17,MK_REP,6000,-,201,20

In [114]:
df2.head()

  FirstName  LastName   Department   Salary
0      John       Doe  Engineering  7500000
1      Jane     Smith    Marketing  6800000
2   Michael     Brown  Engineering  8800000
3     Linda   Johnson           HR  5500000
4    Robert  Williams      Finance  6200000

In [128]:
df3.head()

,EmployeeID,FirstName,LastName,Department,Position,Salary,JoiningDate,Email
0,10100,John,Doe,Engineering,Software Engineer,7500000,1970-02-20 09:25:00,john.doe@example.com
1,10200,Jane,Smith,Marketing,Marketing Manager,6800000,1970-02-20 22:35:00,jane.smith@example.com
2,10300,Michael,Brown,Engineering,Senior Developer,8800000,1970-02-20 06:13:20,michael.brown@example.com
3,10400,Linda,Johnson,HR,HR Executive,5500000,1970-02-21 03:56:40,linda.johnson@example.com
4,10500,Robert,Williams,Finance,Accountant,6200000,1970-02-20 14:15:00,robert.williams@example.com

In [129]:
del df2

T7. Replace all NaN values in Salary with the columnâ€™s median.

In [153]:
import numpy as np
salary=pd.Series(
    [10000,np.nan,20000,30000,np.nan]
)
salary

0    10000.0
1        NaN
2    20000.0
3    30000.0
4        NaN
dtype: float64

In [140]:
temp={
    "name":"sagar",
    "Age":34
}
se=pd.Series(temp)
se

name    sagar
Age        34
dtype: object

In [146]:
salary.shape

(5,)

In [145]:
salary.info()

<class 'pandas.core.series.Series'>
RangeIndex: 5 entries, 0 to 4
Series name: salary
Non-Null Count  Dtype
--------------  -----
3 non-null      float64
dtypes: float64(1)
memory usage: 172.0 bytes

In [144]:
salary.name="salary"

In [155]:
salary.fillna(salary.median(),inplace=True)
salary

0    10000.0
1    20000.0
2    20000.0
3    30000.0
4    20000.0
dtype: float64

T8. Create a new column SalaryLakh = Salary / 100000.

In [163]:
df3.head()

,EmployeeID,FirstName,LastName,Department,Position,Salary,JoiningDate,Email,Salarylakh
0,10100,John,Doe,Engineering,Software Engineer,7500000,1970-02-20 09:25:00,john.doe@example.com,75.0
1,10200,Jane,Smith,Marketing,Marketing Manager,6800000,1970-02-20 22:35:00,jane.smith@example.com,68.0
2,10300,Michael,Brown,Engineering,Senior Developer,8800000,1970-02-20 06:13:20,michael.brown@example.com,88.0
3,10400,Linda,Johnson,HR,HR Executive,5500000,1970-02-21 03:56:40,linda.johnson@example.com,55.0
4,10500,Robert,Williams,Finance,Accountant,6200000,1970-02-20 14:15:00,robert.williams@example.com,62.0

In [161]:
df3["Salarylakh"]=df3["Salary"]/100000

In [192]:
df3.head()

,EmployeeID,FirstName,LastName,Department,Position,Salary,JoiningDate,Email,Salarylakh
0,10100,John,Doe,Engineering,Software Engineer,7500000,1970-02-20 09:25:00,john.doe@example.com,75.0
1,10200,Jane,Smith,Marketing,Marketing Manager,6800000,1970-02-20 22:35:00,jane.smith@example.com,68.0
2,10300,Michael,Brown,Engineering,Senior Developer,8800000,1970-02-20 06:13:20,michael.brown@example.com,88.0
3,10400,Linda,Johnson,HR,HR Executive,5500000,1970-02-21 03:56:40,linda.johnson@example.com,55.0
4,10500,Robert,Williams,Finance,Accountant,6200000,1970-02-20 14:15:00,robert.williams@example.com,62.0

### ðŸŸ¦ SECTION 2 â€” FILTERING, INDEXING & SELECTION (8 Practical Tasks)

T9. Select all employees with Salarylakh >80.0.

In [170]:
df3.head()

,EmployeeID,FirstName,LastName,Department,Position,Salary,JoiningDate,Email,Salarylakh
0,10100,John,Doe,Engineering,Software Engineer,7500000,1970-02-20 09:25:00,john.doe@example.com,75.0
1,10200,Jane,Smith,Marketing,Marketing Manager,6800000,1970-02-20 22:35:00,jane.smith@example.com,68.0
2,10300,Michael,Brown,Engineering,Senior Developer,8800000,1970-02-20 06:13:20,michael.brown@example.com,88.0
3,10400,Linda,Johnson,HR,HR Executive,5500000,1970-02-21 03:56:40,linda.johnson@example.com,55.0
4,10500,Robert,Williams,Finance,Accountant,6200000,1970-02-20 14:15:00,robert.williams@example.com,62.0

In [169]:
df3[df3["Salarylakh"]>80.0]

,EmployeeID,FirstName,LastName,Department,Position,Salary,JoiningDate,Email,Salarylakh
2,10300,Michael,Brown,Engineering,Senior Developer,8800000,1970-02-20 06:13:20,michael.brown@example.com,88.0
5,10600,Emily,Jones,Engineering,Data Scientist,9200000,1970-02-20 21:21:40,emily.jones@example.com,92.0
8,10900,Chris,Wilson,Engineering,DevOps Engineer,8700000,1970-02-20 03:51:40,chris.wilson@example.com,87.0
12,11300,Matthew,Thomas,Engineering,Backend Developer,8100000,1970-02-21 01:15:00,matthew.thomas@example.com,81.0

T10. Select employees in Engineering OR HR department using .isin().

In [173]:
df3[df3["Department"].isin(["Engineering","HR"])]

,EmployeeID,FirstName,LastName,Department,Position,Salary,JoiningDate,Email,Salarylakh
0,10100,John,Doe,Engineering,Software Engineer,7500000,1970-02-20 09:25:00,john.doe@example.com,75.0
2,10300,Michael,Brown,Engineering,Senior Developer,8800000,1970-02-20 06:13:20,michael.brown@example.com,88.0
3,10400,Linda,Johnson,HR,HR Executive,5500000,1970-02-21 03:56:40,linda.johnson@example.com,55.0
5,10600,Emily,Jones,Engineering,Data Scientist,9200000,1970-02-20 21:21:40,emily.jones@example.com,92.0
6,10700,David,Miller,Engineering,NaN,8000000,1970-02-20 16:41:40,david.miller@example.com,80.0
8,10900,Chris,Wilson,Engineering,DevOps Engineer,8700000,1970-02-20 03:51:40,chris.wilson@example.com,87.0
10,11100,Daniel,Taylor,Engineering,Software Engineer,7600000,1970-02-21 11:15:00,daniel.taylor@example.com,76.0
11,11200,Jessica,Anderson,HR,Recruiter,5400000,1970-02-20 10:28:20,jessica.anderson@example.com,54.0
12,11300,Matthew,Thomas,Engineering,Backend Developer,8100000,1970-02-21 01:15:00,matthew.thomas@example.com,81.0

In [177]:
df3[(df3["Department"]=="HR")|(df3["Department"]=="Engineering")]

,EmployeeID,FirstName,LastName,Department,Position,Salary,JoiningDate,Email,Salarylakh
0,10100,John,Doe,Engineering,Software Engineer,7500000,1970-02-20 09:25:00,john.doe@example.com,75.0
2,10300,Michael,Brown,Engineering,Senior Developer,8800000,1970-02-20 06:13:20,michael.brown@example.com,88.0
3,10400,Linda,Johnson,HR,HR Executive,5500000,1970-02-21 03:56:40,linda.johnson@example.com,55.0
5,10600,Emily,Jones,Engineering,Data Scientist,9200000,1970-02-20 21:21:40,emily.jones@example.com,92.0
6,10700,David,Miller,Engineering,NaN,8000000,1970-02-20 16:41:40,david.miller@example.com,80.0
8,10900,Chris,Wilson,Engineering,DevOps Engineer,8700000,1970-02-20 03:51:40,chris.wilson@example.com,87.0
10,11100,Daniel,Taylor,Engineering,Software Engineer,7600000,1970-02-21 11:15:00,daniel.taylor@example.com,76.0
11,11200,Jessica,Anderson,HR,Recruiter,5400000,1970-02-20 10:28:20,jessica.anderson@example.com,54.0
12,11300,Matthew,Thomas,Engineering,Backend Developer,8100000,1970-02-21 01:15:00,matthew.thomas@example.com,81.0

T11. Select rows where Name starts with letter â€œJâ€.

In [190]:
df3[df3["FirstName"].str.startswith("J")]

,EmployeeID,FirstName,LastName,Department,Position,Salary,JoiningDate,Email,Salarylakh
0,10100,John,Doe,Engineering,Software Engineer,7500000,1970-02-20 09:25:00,john.doe@example.com,75.0
1,10200,Jane,Smith,Marketing,Marketing Manager,6800000,1970-02-20 22:35:00,jane.smith@example.com,68.0
11,11200,Jessica,Anderson,HR,Recruiter,5400000,1970-02-20 10:28:20,jessica.anderson@example.com,54.0